server/src/reports/artillery-info.log
Phase started: unnamed (index: 0, duration: 1s) 09:52:52(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 09:52:53(-0300)

--------------------------------------
Metrics for period to: 09:53:00(-0300) (width: 1.792s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 563/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 141
  median: ...................................................................... 43.4
  p95: ......................................................................... 94.6
  p99: ......................................................................... 108.9
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 299
  max: ......................................................................... 1124.2
  median: ...................................................................... 982.6
  p95: ......................................................................... 1107.9
  p99: ......................................................................... 1107.9


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 09:52:55(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 563/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 141
  median: ...................................................................... 43.4
  p95: ......................................................................... 94.6
  p99: ......................................................................... 108.9
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 299
  max: ......................................................................... 1124.2
  median: ...................................................................... 982.6
  p95: ......................................................................... 1107.9
  p99: ......................................................................... 1107.9